-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 01 月 06 日 22:33
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 8.1.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `RamenMap`
--

-- --------------------------------------------------------

--
-- 資料表結構 `location`
--

CREATE TABLE `location` (
  `StoreID` int(50) NOT NULL,
  `StoreName` varchar(255) NOT NULL,
  `MRTStation` varchar(35) NOT NULL,
  `MRTRoute` varchar(20) NOT NULL,
  `Address` varchar(255) DEFAULT NULL,
  `CoordinateX` double(60,15) NOT NULL,
  `CoordinateY` double(60,15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `location`
--

INSERT INTO `location` (`StoreID`, `StoreName`, `MRTStation`, `MRTRoute`, `Address`, `CoordinateX`, `CoordinateY`) VALUES
(1, 'ラーメン凪 Ramen Nagi (信義店)\r\n', '象山', '淡水信義線(紅線)', '110台北市信義區松壽路22號2樓\r\n', 25.036261986260900, 121.567397684475000),
(2, '一幻拉麵 台北信義店\r\n', '象山', '淡水信義線(紅線)', '110台北市信義區松壽路30號1樓\r\n', 25.036684320300900, 121.567544860157000),
(3, '一真亭ラーメン\r\n', '台北101/世貿', '淡水信義線(紅線)', '11050台北市信義區莊敬路325巷50號\r\n', 25.029718661546300, 121.564360782895000),
(4, '一蘭 台灣台北別館', '象山', '淡水信義線(紅線)', '110台北市信義區松壽路11號\r\n', 25.037251333381100, 121.567369174953000),
(5, '一蘭 台灣台北本店', '象山', '淡水信義線(紅線)', '110台北市信義區松仁路97號\r\n', 25.036941703421100, 121.569432590296000),
(6, '一風堂EXPRESS微風南山店\r\n', '台北101/世貿', '淡水信義線(紅線)', 'B2樓 17號, 松智路信義區台北市110\r\n', 25.033673730023600, 121.565499019133000),
(7, '一風堂台北101店\r\n', '台北101/世貿', '淡水信義線(紅線)', '110台北市信義區信義路五段7號B1\r\n', 25.034291016356500, 121.564281439069000),
(8, '一風堂微風台北車站店\r\n', '台北車站', '淡水信義線(紅線)', '100台北市中正區北平西路3號2樓\r\n', 25.048398936966100, 121.517107057553000),
(9, '二月ラーメン拉麵\r\n', '淡水', '淡水信義線(紅線)', '251新北市淡水區中山北路一段74號\r\n', 25.176185776835800, 121.442288684140000),
(10, '勝王\r\n', '雙連(馬偕紀念醫院)', '淡水信義線(紅線)', '104台北市中山區林森北路306號\r\n', 25.057017913071500, 121.525614967015000),
(11, '吉鴙拉麵\r\n', '大安', '淡水信義線(紅線)', '106台北市大安區信義路三段166巷2-1號\r\n', 25.033475776975100, 121.541748713938000),
(12, '太陽蕃茄拉麵 站前本店\r\n', '台北車站', '淡水信義線(紅線)', '100台北市中正區忠孝西路一段38號凱撤飯店B1F\r\n', 25.046336066903600, 121.516449194455000),
(13, '屯京拉麵 (新光三越A8)\r\n', '象山', '淡水信義線(紅線)', '110台北市信義區松高路12號號 B2\r\n', 25.038596240565800, 121.566701574954000),
(14, '屯京拉麵 中山店\r\n', '中山', '淡水信義線(紅線)', '10491台北市中山區中山北路一段141號\r\n', 25.052237518687700, 121.522788657077000),
(15, '屯京拉麵 台北站前店\r\n', '台北車站', '淡水信義線(紅線)', '100台北市中正區忠孝西路一段38號B1\r\n', 25.046996979243800, 121.516237159614000),
(16, '山嵐拉麵 大安店\r\n', '大安', '淡水信義線(紅線)', '之5, No. 84號復興南路二段大安區台北市10664\r\n', 25.031653047667800, 121.543064524056000),
(17, '山形心心拉麵\r\n', '劍潭', '淡水信義線(紅線)', '111台北市士林區小東街25號\r\n', 25.089472746272500, 121.526082664738000),
(18, '札幌炎神拉麵 ATT 4 FUN 信義店\r\n', '象山', '淡水信義線(紅線)', '4樓, No. 12號松壽路信義區台北市110\r\n', 25.035623312273800, 121.566123168510000),
(19, '柑橘Shinn - Soba\r\n', '信義安和', '淡水信義線(紅線)', '106台北市大安區仁愛路四段228-6號\r\n', 25.037953314272200, 121.552382605639000),
(20, '樂山窄巷\r\n', '北投', '淡水信義線(紅線)', '112台北市北投區大同街27號\r\n', 25.133185097621700, 121.498994811168000),
(21, '橫濱家系拉麵 特濃屋\r\n', '雙連(馬偕紀念醫院)', '淡水信義線(紅線)', '104台北市中山區中山北路二段77巷22號\r\n', 25.057879012347100, 121.525090212459000),
(22, '荷麵亭Hasumentei 士林店\r\n', '士林', '淡水信義線(紅線)', '111台北市士林區中山北路五段505巷42弄2號\r\n', 25.093349973618700, 121.526685812975000),
(23, '藤芯•拉麵\r\n', '劍潭', '淡水信義線(紅線)', '111011台北市士林區文林路110巷5號\r\n', 25.088480084603700, 121.526593754551000),
(24, '象子 麵\r\n', '象山', '淡水信義線(紅線)', '110台北市信義區信義路五段150巷14弄2-2號號1樓\r\n\r\n', 25.029133822594600, 121.569139915346000),
(25, '道樂屋台\r\n', '士林', '淡水信義線(紅線)', '111台北市士林區基河路112號\r\n', 25.088942352199300, 121.523273434882000),
(26, '醇一拉麵\r\n', '大安', '淡水信義線(紅線)', '106台北市大安區仁愛路四段48巷30-1號\r\n', 25.036916205427200, 121.546849513583000),
(27, '隱家拉麵\r\n', '士林', '淡水信義線(紅線)', '111台北市士林區中山北路五段505巷1號\r\n', 25.094376556262800, 121.527306698493000),
(28, '隱家拉麵 芝山店\r\n', '芝山', '淡水信義線(紅線)', '11158台北市士林區福華路140號1F\r\n', 25.104281106301300, 121.523026437319000),
(29, '隱家拉麵 赤峰店\r\n', '雙連(馬偕紀念醫院)', '淡水信義線(紅線)', '103台北市大同區南京西路25巷28號\r\n', 25.056855401474000, 121.520469825657000),
(30, '麵屋 緣\r\n', '信義安和', '淡水信義線(紅線)', '106台北市大安區敦化南路二段81巷45弄12號1樓\r\n', 25.031075737876300, 121.550002950238000),
(31, '麵屋武藏-本店\r\n', '台北車站', '淡水信義線(紅線)', '100台北市中正區忠孝西路一段36號B1\r\n', 25.046101183690200, 121.517050212160000),
(32, '麵屋武藏-神山\r\n', '中山', '淡水信義線(紅線)', '104台北市中山區中山北路一段121巷18號\r\n', 25.051343450030600, 121.524827136485000),
(33, '黑曜麵屋\r\n', '石牌 (榮總)', '淡水信義線(紅線)', '112台北市北投區尊賢街206巷2號\r\n', 25.115527131323300, 121.508210055121000),
(34, '黑田屋\r\n', '民權西路', '淡水信義線(紅線)', '104台北市中山區錦西街31號\r\n', 25.060597666446000, 121.520666224541000),
(35, '泰拉風拉麵店\r\n', '板橋', '板南線(藍線)', '220新北市板橋區公館街33號\r\n', 25.016553169558600, 121.461238802247000),
(36, '初原麵場(新板特區店)\r\n', '板橋', '板南線(藍線)', '220新北市板橋區漢生東路117-2號\r\n', 25.019726768632300, 121.467424935388000),
(37, '濟善老麵\r\n', '龍山寺（艋舺商圈）', '板南線(藍線)', '108台北市萬華區艋舺大道120巷11弄1號\r\n', 25.033958710657500, 121.502110567554000),
(38, '東京油組總本店 台北華山組\r\n', '善導寺（華山）', '板南線(藍線)', '100台北市中正區忠孝東路一段140號\r\n', 25.044265328881100, 121.525555774300000),
(39, '鳥人拉麵-台灣總店TOTTO Ramen\r\n', '忠孝復興', '板南線(藍線)', '106台北市大安區復興南路一段107巷5弄9號\r\n', 25.044427736707900, 121.544303599021000),
(40, '凪Nagi 忠孝店\r\n', '忠孝復興', '板南線(藍線)', '106台北市大安區大安路一段75巷5號1\r\n', 25.042980421722500, 121.546317867557000),
(41, '豚人拉麵復興店 京都一乗寺豚人ラーメン\r\n', '忠孝復興', '板南線(藍線)', '10697台北市大安區大安路一段16巷6號\r\n', 25.045076351782000, 121.546062805641000),
(42, '橫濱家系ラーメン大和家\r\n', '忠孝復興', '板南線(藍線)', '106台北市大安區市民大道四段12號\r\n', 25.045736490118200, 121.544319613586000),
(43, '裸湯拉麵\r\n', '忠孝敦化', '板南線(藍線)', '106台北市大安區敦化南路一段238巷1號\r\n', 25.040693329167200, 121.547884644112000),
(44, '麵屋牛一\r\n', '忠孝敦化', '板南線(藍線)', '106台北市大安區敦化南路1段151號\r\n', 25.044084181738900, 121.549384720644000),
(45, '豚人ラ－メン_台灣本店\r\n', '忠孝敦化', '板南線(藍線)', '106台北市大安區忠孝東路四段170巷5弄10號\r\n', 25.041452619346600, 121.551273351923000),
(46, '麺処田冶\r\n', '忠孝敦化', '板南線(藍線)', '10691台北市大安區忠孝東路四段216巷40弄9號 １F\r\n', 25.039931770620500, 121.552395457029000),
(47, '麵屋壹の穴 ICHI\r\n', '國父紀念館', '板南線(藍線)', '106台北市大安區延吉街137巷22號\r\n', 25.042357897323200, 121.555357664758000),
(48, 'Due Italian\r\n', '市政府', '板南線(藍線)', '110台北市信義區松高路19號\r\n', 25.040072157377300, 121.566813091014000),
(49, '五之神製作所 台灣\r\n', '市政府', '板南線(藍線)', '110台北市信義區忠孝東路四段553巷6弄6號\r\n', 25.042905803258600, 121.563043844270000),
(50, '鷹流東京涼麺 涼風庵\r\n', '市政府', '板南線(藍線)', '110台北市信義區忠孝東路五段183號\r\n', 25.042159396002500, 121.569562097695000),
(51, '熊二拉麵\r\n', '永春', '板南線(藍線)', '11075台北市信義區虎林街164巷11號\r\n', 25.039870731263800, 121.576303582352000),
(52, '海貓亭拉麵 うみねこ亭\r\n', '新店 (碧潭)', '松山新店線(綠線)', '231新北市新店區新店路27號\r\n', 24.953062582133400, 121.540036683988000),
(53, 'Hiro\'s らぁ麵Kitchen 新店店\r\n', '大坪林', '松山新店線(綠線)', '231新北市新店區文化路5號1樓\r\n', 24.980112363739100, 121.542869390277000),
(54, '墨洋拉麵\r\n', '公館 (台灣大學)', '松山新店線(綠線)', '100台北市中正區羅斯福路四段136巷10號\r\n', 25.012964016277500, 121.535570092995000),
(55, '鷹流東京豚骨拉麵-極匠\r\n', '公館 (台灣大學)', '松山新店線(綠線)', '100台北市中正區汀州路三段104巷4號\r\n', 25.014378196889500, 121.533070743387000),
(56, '山嵐拉麵 公館店\r\n', '公館 (台灣大學)', '松山新店線(綠線)', '100台北市中正區羅斯福路四段136巷1弄13號\r\n', 25.013955710701900, 121.535307413575000),
(57, '真劍拉麵\r\n', '台電大樓', '松山新店線(綠線)', '106台北市大安區師大路126巷1號\r\n', 25.021868649935100, 121.527852232471000),
(58, '山嵐拉麵 古亭店\r\n', '古亭', '松山新店線(綠線)', '106台北市大安區杭州南路二段75號\r\n', 25.030307283003400, 121.522102674951000),
(59, '重熙老麵\r\n', '小南門', '松山新店線(綠線)', '100台北市中正區廣州街8巷7號\r\n', 25.035272788110900, 121.508300398959000),
(60, '吉天元拉麵\r\n', '西門', '松山新店線(綠線)', '108台北市萬華區西寧南路70號B1\r\n', 25.044484578292000, 121.505984290298000),
(61, '道樂商店\r\n', '西門', '松山新店線(綠線)', '108台北市萬華區成都路27巷12號\r\n', 25.043355253315500, 121.506804910485000),
(62, '豚骨拉麵 Nagi 凪 西門店\r\n', '西門', '松山新店線(綠線)', '108台北市萬華區漢中街52號6樓\r\n', 25.044171822685900, 121.507405856554000),
(63, 'Totto Ramen 鳥人拉麵 西門店\r\n', '西門', '松山新店線(綠線)', '108台北市萬華區中華路一段108號\r\n', 25.044809114624700, 121.508426874956000),
(64, '辣麻味噌拉麵 鬼金棒 松江南京店\r\n', '松江南京', '松山新店線(綠線)', '10491台北市中山區松江路123巷8-2號\r\n', 25.053089971128000, 121.533963665839000),
(65, '美濃屋\r\n', '松江南京', '松山新店線(綠線)', '10491台北市中山區新生北路一段108之1號\r\n', 25.050194303971600, 121.528152428930000),
(66, '麵屋輝\r\n', '松江南京', '松山新店線(綠線)', '10491台北市中山區伊通街8-1號\r\n', 25.050341818348300, 121.534870636328000),
(67, '拉麵公子\r\n', '南京復興', '松山新店線(綠線)', '104台北市中山區八德路二段279號\r\n', 25.047561225254100, 121.541623940183000),
(68, '麵試十一次\r\n', '台北小巨蛋', '松山新店線(綠線)', '105台北市松山區健康路68號之3號\r\n', 25.054036150180400, 121.553987867014000),
(69, '小高拉麵南勢角\r\n', '南勢角', '中和新蘆線(橘線)', '235新北市中和區景新街471號1樓\r\n', 24.988400150980900, 121.513676448337000),
(70, '藏味拉麵\r\n', '景安', '中和新蘆線(橘線)', '235新北市中和區景安路132巷1號\r\n', 24.995080668908900, 121.505035851652000),
(71, '初原麵場(中和南華店)\r\n', '景安', '中和新蘆線(橘線)', '235新北市中和區南華路79號\r\n', 24.998118500880900, 121.505518372377000),
(72, '辰拉麵\r\n', '頂溪', '中和新蘆線(橘線)', '234新北市永和區文化路110號1樓\r\n', 25.015811593926100, 121.513484604699000),
(73, '麵屋壹慶\r\n', '中山國小（晴光商圈）', '中和新蘆線(橘線)', '10491台北市中山區雙城街32巷2號\r\n', 25.066919439502700, 121.524105713593000),
(74, '創作拉麵 悠然\r\n', '中山國小（晴光商圈）', '中和新蘆線(橘線)', '10491台北市中山區林森北路487號1 樓 209 室\r\n', 25.062299392699100, 121.526901059619000),
(75, '富山天滿\r\n', '大橋頭（大橋國小）', '中和新蘆線(橘線)', '103台北市大同區民族西路223之2號\r\n', 25.069817976659200, 121.513459254941000),
(76, '麵屋道樂\r\n', '徐匯中學', '中和新蘆線(橘線)', '24152新北市三重區仁愛街688號\r\n', 25.080763816357000, 121.481512511855000),
(77, '坂道拉麵\r\n', '三民高中（空中大學）', '中和新蘆線(橘線)', '24757新北市蘆洲區正和街7號1樓\r\n', 25.082870726017900, 121.470413367432000),
(78, '柑橘鴨蔥\r\n', '六張犁', '文湖線(棕線)', '110台北市信義區嘉興街315號\r\n', 25.024021046914100, 121.554443044242000),
(79, '重熙老麵-樂利店\r\n', '六張犁', '文湖線(棕線)', '106台北市大安區樂利路86巷6號\r\n', 25.025601203705900, 121.551736117769000),
(80, '崇燈拉麵\r\n', '六張犁', '文湖線(棕線)', '106台北市大安區基隆路二段263號\r\n', 25.023143028271600, 121.550393874949000),
(81, '小川拉麵\r\n', '科技大樓', '文湖線(棕線)', '106台北市大安區復興南路二段190號\r\n', 25.027886407363100, 121.543444519118000),
(82, '裸湯拉麵\r\n', '科技大樓', '文湖線(棕線)', '106台北市大安區和平東路二段116號1樓\r\n', 25.025718994527900, 121.542699228922000),
(83, '壹之穴\r\n', '科技大樓', '文湖線(棕線)', '106台北市大安區復興南路二段350號\r\n', 25.023045754027500, 121.542856652208000),
(84, '勝拉麵\r\n', '大直(實踐大學)', '文湖線(棕線)', '10491台北市中山區北安路621巷46號\r\n', 25.083801346835800, 121.546806805654000),
(85, '凪(Nagi)- 大直店\r\n', '劍南路(美麗華)', '文湖線(棕線)', '10491台北市中山區樂群三路301號2樓\r\n', 25.083317612726800, 121.559536127056000),
(86, '雞吉君拉麵\r\n', '西湖(德明科大)', '文湖線(棕線)', '114台北市內湖區環山路一段33號\r\n', 25.087048652254800, 121.567126490312000),
(87, '鳳華拉麵 （らぁ麺 鳳華）\r\n', '西湖(德明科大)', '文湖線(棕線)', '114台北市內湖區內湖路一段411巷6號\r\n', 25.082802812088300, 121.570750598255000),
(88, '一番星拉麵\r\n', '西湖(德明科大)', '文湖線(棕線)', '2樓, 內湖路一段285號 101攤位, 內湖區台北市114\r\n', 25.083349882035700, 121.566365713598000),
(89, '麵屋一番\r\n', '港墘', '文湖線(棕線)', '114台北市內湖區內湖路一段737巷8弄12號\r\n', 25.080198028648500, 121.577742098255000),
(90, '北一家拉麺\r\n', '港墘', '文湖線(棕線)', '114台北市內湖區江南街71巷16弄38號\r\n', 25.076391323394400, 121.577520713596000),
(91, '麵屋昕家\r\n', '東湖', '文湖線(棕線)', '114台北市內湖區東湖路24號\r\n', 25.069717604179800, 121.612726644279000),
(92, '双豚ラーメン\r\n', '新埔民生', '環狀線(黃線)', '220新北市板橋區民生路三段193號\r\n', 25.028381883689400, 121.465345917224000),
(93, '熊越岳\r\n', '幸福', '環狀線(黃線)', '242新北市新莊區幸福路750號\r\n', 25.049897597480400, 121.447650432921000);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `location`
--
ALTER TABLE `location`
  ADD PRIMARY KEY (`StoreID`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `location`
--
ALTER TABLE `location`
  MODIFY `StoreID` int(50) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=94;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
