-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2022 年 01 月 08 日 11:53
-- 伺服器版本： 10.4.21-MariaDB
-- PHP 版本： 8.1.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `RamenMap`
--

-- --------------------------------------------------------

--
-- 資料表結構 `ramen`
--

CREATE TABLE `ramen` (
  `RamenID` int(50) NOT NULL,
  `StoreID` int(50) NOT NULL,
  `RamenName` varchar(35) NOT NULL,
  `Price` int(20) NOT NULL,
  `RamenType` varchar(35) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `ramen`
--

INSERT INTO `ramen` (`RamenID`, `StoreID`, `RamenName`, `Price`, `RamenType`) VALUES
(1, 4, '天然豚骨拉麵', 288, '豚骨'),
(2, 5, '天然豚骨拉麵', 288, '豚骨'),
(3, 1, '豚王', 205, ''),
(4, 1, '黑王', 235, ''),
(5, 1, '赤王', 235, ''),
(6, 1, '翠王', 235, ''),
(7, 40, '豚王', 205, ''),
(8, 40, '黑王', 235, ''),
(9, 40, '赤王', 235, ''),
(10, 40, '翠王', 235, ''),
(11, 85, '翠王', 235, ''),
(12, 85, '豚王', 205, ''),
(13, 85, '黑王', 235, ''),
(14, 85, '赤王', 235, ''),
(15, 62, '豚王', 205, ''),
(16, 62, '黑王', 235, ''),
(17, 62, '赤王', 235, ''),
(18, 62, '翠王', 235, ''),
(19, 2, '鮮蝦醬油', 205, ''),
(20, 2, '鮮蝦味噌', 205, ''),
(21, 2, '鮮蝦鹽味', 205, ''),
(22, 3, '辣味豚骨拉麵', 210, ''),
(23, 3, '辣味叉燒拉麵', 250, ''),
(24, 3, '辣味糖心蛋拉麵', 240, ''),
(25, 3, '豚骨拉麵', 180, ''),
(26, 3, '叉燒麵', 220, ''),
(27, 3, '糖心蛋拉麵', 210, ''),
(28, 3, '焦蒜蔥拉麵', 210, ''),
(29, 3, '焦蒜蔥叉燒麵', 250, ''),
(30, 3, '焦蒜蔥糖心蛋拉麵', 240, ''),
(31, 3, '味噌拉麵', 250, ''),
(32, 3, '鹽味拉麵', 230, ''),
(33, 6, '特製博多豚骨', 230, ''),
(34, 6, '博多豚骨', 170, ''),
(35, 6, '特製辣肉味噌', 250, ''),
(36, 6, '辣肉味噌', 190, ''),
(37, 6, '特製黑帶豬軟骨', 270, ''),
(38, 6, '黑帶豬軟骨', 210, ''),
(39, 6, '特製博多牛燒肉', 280, ''),
(40, 6, '博多牛燒肉', 230, ''),
(41, 7, '特製博多豚骨', 230, ''),
(42, 7, '博多豚骨', 170, ''),
(43, 7, '特製辣肉味噌', 250, ''),
(44, 7, '辣肉味噌', 190, ''),
(45, 7, '特製黑帶豬軟骨', 270, ''),
(46, 7, '黑帶豬軟骨', 210, ''),
(47, 7, '特製博多牛燒肉', 280, ''),
(48, 7, '博多牛燒肉', 230, ''),
(49, 8, '特製博多豚骨', 230, ''),
(50, 8, '博多豚骨', 170, ''),
(51, 8, '特製辣肉味噌', 250, ''),
(52, 8, '辣肉味噌', 190, ''),
(53, 8, '特製黑帶豬軟骨', 270, ''),
(54, 8, '黑帶豬軟骨', 210, ''),
(55, 8, '特製博多牛燒肉', 280, ''),
(56, 8, '博多牛燒肉', 230, ''),
(57, 9, '肉花', 240, ''),
(58, 9, '海苔', 170, ''),
(59, 9, '蔥花', 170, ''),
(60, 9, '二月', 160, ''),
(61, 9, '拉麵', 130, ''),
(62, 10, '薩索雞白湯拉麵', 250, ''),
(63, 10, '八幡屋七味胡麻擔擔麵', 300, ''),
(64, 10, '油封蟹肉松露醬雞白湯拉麵', 350, ''),
(65, 10, '生鮮松露薩索雞白湯拉麵', 350, ''),
(66, 10, '瑪莎拉香料雞白湯拉麵', 300, ''),
(67, 10, '柚子七味醋橘雞湯拉麵', 260, ''),
(68, 10, '瑪莎拉蟹肉雞白湯拉麵', 350, ''),
(69, 10, '濃厚蛤蜊波菜濃湯拉麵', 280, ''),
(70, 11, '鹽味雞湯拉麵', 190, ''),
(71, 11, '醬油雞湯拉麵', 190, ''),
(72, 11, '濃厚雞白湯拉麵', 200, ''),
(73, 11, '濃厚煮干拉麵', 230, ''),
(74, 12, '太陽滑蛋拉麵', 220, ''),
(75, 12, '太陽起司拉麵', 240, ''),
(76, 12, '太陽鮮蔬拉麵', 200, ''),
(77, 12, '太陽拉麵', 190, ''),
(78, 12, '太陽茄子拉麵', 230, ''),
(79, 12, '太陽蛤蠣拉麵', 160, ''),
(80, 12, '太陽酸辣拉麵', 260, ''),
(81, 12, '香蒜辣太陽拉麵', 210, ''),
(82, 12, '雙重起司太陽拉麵', 280, ''),
(83, 12, '番茄咖哩滑蛋拉麵', 250, ''),
(84, 12, '番茄咖哩起司拉麵', 250, ''),
(85, 12, '番茄咖哩鮮蔬拉麵', 210, ''),
(86, 12, '番茄咖哩拉麵', 200, ''),
(87, 12, '雞骨白湯拉麵', 190, ''),
(88, 12, '炙燒雞骨白湯拉麵', 250, ''),
(89, 12, '雞骨白湯鮮蔬拉麵', 200, ''),
(90, 13, '超值東京豚骨拉麵', 280, ''),
(91, 13, '魚豚叉燒拉麵', 300, ''),
(92, 13, '麻辣豚骨京蔥拉麵', 280, ''),
(93, 13, '奶油玉米味噌拉麵', 270, ''),
(94, 13, '魚豚沾麵', 230, ''),
(95, 13, '麻辣沾麵', 220, ''),
(96, 14, '超值東京豚骨拉麵', 280, ''),
(97, 14, '魚豚叉燒拉麵', 300, ''),
(98, 14, '麻辣豚骨京蔥拉麵', 280, ''),
(99, 14, '奶油玉米味噌拉麵', 270, ''),
(100, 14, '魚豚沾麵', 230, ''),
(101, 14, '麻辣沾麵', 220, ''),
(102, 15, '超值東京豚骨拉麵', 280, ''),
(103, 15, '魚豚叉燒拉麵', 300, ''),
(104, 15, '麻辣豚骨京蔥拉麵', 280, ''),
(105, 15, '奶油玉米味噌拉麵', 270, ''),
(106, 15, '魚豚沾麵', 230, ''),
(107, 15, '麻辣沾麵', 220, ''),
(108, 16, '白湯', 230, ''),
(109, 16, '赤湯', 260, ''),
(110, 16, '海湯', 260, ''),
(111, 56, '白湯', 230, ''),
(112, 56, '赤湯', 260, ''),
(113, 56, '海湯', 260, ''),
(114, 58, '白湯', 230, ''),
(115, 58, '赤湯', 260, ''),
(116, 58, '海湯', 260, ''),
(117, 17, '醬油拉麵', 130, ''),
(118, 17, '鹽拉麵', 140, ''),
(119, 17, '辛味噌拉麵', 150, ''),
(120, 17, '秘傳味噌拉麵', 150, ''),
(121, 17, '味噌拉麵', 150, ''),
(122, 17, '學生拉麵', 100, ''),
(123, 18, '黃金海岸辣味豚骨拉麵', 300, ''),
(124, 18, '海薰炎湖拉麵', 250, ''),
(125, 18, '黃金海岸辣味豚骨拉麵', 250, ''),
(126, 18, '炙炎豚骨鹽味拉麵', 250, ''),
(127, 18, '炙炎豚骨鹽味拉麵豪華版', 300, ''),
(128, 19, '柑橘鹽味拉麵', 180, ''),
(129, 19, '柑橘醬油魚介拉麵', 200, ''),
(130, 19, '柑橘濃厚雞白湯拉麵', 199, ''),
(131, 19, '淡麗柑橘蛤蜊拉麵', 240, ''),
(132, 19, '雞白湯柑橘蛤蜊拉麵', 260, ''),
(133, 19, '濃厚柑橘蛤蜊拉麵', 280, ''),
(134, 20, '醬油拉麵', 150, ''),
(135, 20, '豚骨拉麵', 150, ''),
(136, 20, '地獄拉麵', 180, ''),
(137, 20, '奶油玉米拉麵', 180, ''),
(138, 20, '焦蒜辣醬油拉麵', 180, ''),
(139, 20, '三星蔥濃豚骨拉麵', 200, ''),
(140, 20, '胡麻味噌担担拉麵', 200, ''),
(141, 20, '厚切叉燒拉麵', 250, ''),
(142, 20, '鴨拉麵', 250, ''),
(143, 20, '蝦拉麵', 300, ''),
(144, 21, '味玉九州 Black', 260, ''),
(145, 21, '味玉九州豚骨', 240, ''),
(146, 21, '九州豚骨', 210, ''),
(147, 21, '豚骨醬油DX拉麵', 270, ''),
(148, 21, '九州豚骨DX拉麵', 300, ''),
(149, 21, '爆蔥豚骨DX拉麵', 320, ''),
(150, 21, '豚骨醬油RED DX拉麵', 290, ''),
(151, 21, '旨辛RED DX拉麵', 330, ''),
(152, 22, '淡麗正油拉麵', 200, ''),
(153, 22, '味噌拌拉麵', 260, ''),
(154, 22, '和歌山拌拉麵', 260, ''),
(155, 22, '油拌拉麵', 110, ''),
(156, 23, '原味雞湯拉麵', 150, ''),
(157, 23, '藤椒雞湯拉麵', 160, ''),
(158, 23, '蒜蒜雞湯拉麵', 160, ''),
(159, 24, '雞濃白玉雞湯拉麵', 210, ''),
(160, 24, '蔥香雞油拌麵(乾)', 150, ''),
(161, 24, '蔥香雞油拌麵(乾)+雞湯', 190, ''),
(162, 25, '激辛豚骨拉麵', 220, ''),
(163, 25, '味玉激辛拉麵', 230, ''),
(164, 25, '豪華激辛拉麵', 250, ''),
(165, 25, '醬油拉麵', 150, ''),
(166, 25, '味玉醬油拉麵', 180, ''),
(167, 25, '豪華醬油拉麵', 200, ''),
(168, 25, '豚骨拉麵', 170, ''),
(169, 25, '味玉豚骨拉麵', 200, ''),
(170, 25, '豪華豚骨拉麵', 220, ''),
(171, 26, '豚骨鹽味拉麵', 210, ''),
(172, 26, '特盛豚骨鹽味拉麵', 250, ''),
(173, 26, '雞湯拉麵', 220, ''),
(174, 26, '特盛雞湯拉麵', 260, ''),
(175, 26, '魚介醬油拉麵', 220, ''),
(176, 26, '特盛魚介醬油拉麵', 260, ''),
(177, 26, '醇金濃湯濃湯鮮貝拉麵', 310, ''),
(178, 27, '豚骨醬油拉麵', 170, ''),
(179, 27, '辛豚骨拉麵', 200, ''),
(180, 27, '濃厚海老沾麵', 240, ''),
(181, 27, '黃金雞湯拉麵', 180, ''),
(182, 28, '豚骨醬油拉麵', 170, ''),
(183, 28, '辛豚骨拉麵', 200, ''),
(184, 28, '濃厚海老沾麵', 240, ''),
(185, 28, '黃金雞湯拉麵', 180, ''),
(186, 29, '豚骨醬油拉麵', 170, ''),
(187, 29, '辛豚骨拉麵', 200, ''),
(188, 29, '濃厚海老沾麵', 240, ''),
(189, 29, '黃金雞湯拉麵', 180, ''),
(190, 30, '豚骨魚介湯麵', 280, ''),
(191, 30, '京風咖哩拉麵', 320, ''),
(192, 30, '濃乳咖哩冷麵', 320, ''),
(193, 30, '柚子冷麵', 320, ''),
(194, 30, '辣柚醬冷麵', 320, ''),
(195, 30, '豚骨魚介沾麵', 300, ''),
(196, 30, '白醬沾麵', 320, ''),
(197, 31, '味玉叉燒雞白湯拉麵', 280, ''),
(198, 31, '味玉辛雞白湯拉麵', 250, ''),
(199, 31, '味玉蒜味雞白湯拉麵', 250, ''),
(200, 32, '味玉叉燒雞白湯拉麵', 280, ''),
(201, 32, '味玉辛雞白湯拉麵', 250, ''),
(202, 32, '味玉蒜味雞白湯拉麵', 250, ''),
(203, 33, '原味豚骨', 130, ''),
(204, 33, '黑曜拉麵', 150, ''),
(205, 33, '辛辣豚骨', 150, ''),
(206, 33, '椒麻豚骨', 150, ''),
(207, 33, '青醬豚骨', 150, ''),
(208, 34, '豚骨拉麵', 200, ''),
(209, 34, '叉燒拉麵', 250, ''),
(210, 34, '蔬菜拉麵', 180, ''),
(211, 34, '蔥燒拉麵', 240, ''),
(212, 34, '辣味拉麵', 220, ''),
(213, 34, '蔥燒辣味拉麵', 260, ''),
(214, 34, '地獄拉麵', 250, ''),
(215, 34, '地獄叉燒拉麵', 300, ''),
(216, 34, '地獄蔬菜拉麵', 230, ''),
(217, 35, '椒麻炸雞拉麵', 188, ''),
(218, 35, '恰圖恰雞腿拉麵', 188, ''),
(219, 35, '泰酥雞腿排拉麵', 188, ''),
(220, 35, '泰式豬肉拉麵', 188, ''),
(221, 35, '曼谷手撕雞拉麵', 188, ''),
(222, 36, '焙煎醬油豚骨拉麵', 150, ''),
(223, 36, '焙煎味噌豚骨拉麵', 150, ''),
(224, 36, '焙煎雞白湯拉麵', 150, ''),
(225, 36, '特盛拉麵', 240, ''),
(226, 71, '焙煎醬油豚骨拉麵', 150, ''),
(227, 71, '焙煎味噌豚骨拉麵', 150, ''),
(228, 71, '焙煎雞白湯拉麵', 150, ''),
(229, 71, '特盛拉麵', 240, ''),
(230, 37, '老雞湯麵', 200, ''),
(231, 37, '老雞拌麵', 200, ''),
(232, 37, '極黑羽2.0', 380, ''),
(233, 38, '招牌醬油油麵', 250, ''),
(234, 38, '辣味味噌油麵', 280, ''),
(235, 39, '鳥人白湯拉麵', 200, ''),
(236, 39, '鳥人辛白湯拉麵', 230, '');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `ramen`
--
ALTER TABLE `ramen`
  ADD PRIMARY KEY (`RamenID`),
  ADD KEY `StoreID` (`StoreID`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `ramen`
--
ALTER TABLE `ramen`
  MODIFY `RamenID` int(50) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=237;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `ramen`
--
ALTER TABLE `ramen`
  ADD CONSTRAINT `ramen_fk1` FOREIGN KEY (`StoreID`) REFERENCES `store` (`StoreID`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
